Autodesk.Revit.DB.PartEdgeConditionOrientation
Relative orientation of the right/lower and left/upper edge condition profiles.
Remarks:
A family-based profile defines the shape of the left/upper profile and this
value defines how a matching right/lower profile is obtained.
Since:
2013

Autodesk.Revit.DB.PartEdgeConditionOrientation.MirroredAndRotated
Right/lower profile is obtained first by mirroring the left/upper profile with respect to the
division line and then by mirroring the result with respect to the center line of the
divided thickness. The division gap is not applied.

Autodesk.Revit.DB.PartEdgeConditionOrientation.Mirrored
Right/lower profile is obtained by mirroring the left/upper profile with respect to the
division line. The division gap is not applied.

Autodesk.Revit.DB.PartEdgeConditionOrientation.Complement
Before division gap is applied the left/upper and right/lower profiles coincide
and neighboring panels complement each other precisely.